Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_sdc_sdmem_rx/r_sdc_sd_rx_if.h
sdc_sd_status_t R_SDC_SDMEM_Read(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access);
sdc_sd_status_t R_SDC_SDMEM_ReadSoftwareTrans(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access);
sdc_sd_status_t R_SDC_SDMEM_ReadSoftwareTransSingleCmd(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access);
sdc_sd_status_t R_SDC_SDMEM_Write(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access);
sdc_sd_status_t R_SDC_SDMEM_WriteSoftwareTrans(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access);
sdc_sd_status_t R_SDC_SDMEM_GetSpeed(uint32_t card_no, uint8_t * p_cls, uint8_t * p_move);

sdc_sd_status_t R_SDC_SDIO_IOAbort(uint32_t card_no, uint32_t func);
sdc_sd_status_t R_SDC_SDIO_SetIOEnable(uint32_t card_no, uint32_t func);
sdc_sd_status_t R_SDC_SDIO_ClearIOEnable(uint32_t card_no, uint32_t func);
sdc_sd_status_t R_SDC_SDIO_GetIOReady(uint32_t card_no, uint8_t * p_data);
sdc_sd_status_t R_SDC_SDIO_IOReset(uint32_t card_no);
sdc_sd_status_t R_SDC_SDIO_SetIntEnable(uint32_t card_no);
sdc_sd_status_t R_SDC_SDIO_ClearIntEnable(uint32_t card_no);
sdc_sd_status_t R_SDC_SDIO_GetIntEnable(uint32_t card_no, uint8_t * p_data);
sdc_sd_status_t R_SDC_SDIO_ReadDirect(uint32_t card_no, sdc_sdio_daccess_t * p_sdc_sdio_daccess);
sdc_sd_status_t R_SDC_SDIO_WriteDirect(uint32_t card_no, sdc_sdio_daccess_t * p_sdc_sdio_daccess);
sdc_sd_status_t R_SDC_SDIO_Read(uint32_t card_no, sdc_sdio_access_t * p_sdc_sdio_access);
sdc_sd_status_t R_SDC_SDIO_ReadSoftwareTrans(uint32_t card_no, sdc_sdio_access_t * p_sdc_sdio_access);
sdc_sd_status_t R_SDC_SDIO_Write(uint32_t card_no, sdc_sdio_access_t * p_sdc_sdio_access);
sdc_sd_status_t R_SDC_SDIO_WriteSoftwareTrans(uint32_t card_no, sdc_sdio_access_t * p_sdc_sdio_access);
sdc_sd_status_t R_SDC_SDIO_SetBlocklen(uint32_t card_no, int32_t len, uint32_t func);
sdc_sd_status_t R_SDC_SDIO_GetBlocklen(uint32_t card_no, int32_t * p_len, uint32_t func);
sdc_sd_status_t R_SDC_SDIO_EnableInt(uint32_t card_no);
sdc_sd_status_t R_SDC_SDIO_DisableInt(uint32_t card_no);
sdc_sd_status_t R_SDC_SDIO_GetCIS(uint32_t card_no, sdc_sdio_cis_t * p_sdc_sdio_cis);
sdc_sd_status_t R_SDC_SDIO_IntCallback(uint32_t card_no, sdc_sd_status_t (* callback)(int32_t));



#endif /* SDC_SD_RX_H */

